# GetExportPatternInfo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternTable..::..GetExportPatternInfo Method
ExportPatternTable Class See Also
---
Gets a copy of the pattern info associated to the input pattern key.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportPatternInfo GetExportPatternInfo(
	ExportPatternKey exportPatternKey
)
```

Visual Basic
---
```text
Public Function GetExportPatternInfo ( _
	exportPatternKey As ExportPatternKey _
) As ExportPatternInfo
```

Visual C++
---
```text
public:
ExportPatternInfo^ GetExportPatternInfo(
	ExportPatternKey^ exportPatternKey
)
```

# ### Parameters
exportPatternKey
    Type: Autodesk.Revit.DB..::..ExportPatternKey The export pattern Key.
# ### Return Value
Return the patternInfo for this key.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | An entry with the given key is not present in the table. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace